
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/morisoba00/aws-ecs-terraform/actions/runs/5095998957)



<pre><code>Apply complete! Resources: 7 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
aws_ecr_repository.ecr_repository: Refreshing state... [id=go-simple-server]
data.aws_iam_policy_document.ecs_assume: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0ac5af99053517d53]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-063b5de1a8e57c2f0]
data.aws_iam_policy_document.ecs_assume: Read complete after 0s [id=320642683]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-09bbe5d247799c91a]
data.aws_iam_policy_document.ecs_task_assume: Reading...
data.aws_iam_policy_document.ecs_task_assume: Read complete after 0s [id=320642683]
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Refreshing state... [id=go-simple-server]
aws_security_group.ecs: Refreshing state... [id=sg-01817104820a1c119]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-02fded69eeafebfbb]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-06780cdb2f9d2ac42]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0f444d3d84593377a]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-01847c06253f6a5a3]
aws_security_group.alb: Refreshing state... [id=sg-06b0acbe1b5245215]
aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:972365086582:targetgroup/go-simple-server-target-group/35418404c280c12f]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0094caf37924ecc1c]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0d1f14784708f5dea]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-038a3874d394ce238]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0643033702df490c6]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0c9321dd4a0f03441]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-07b8049beb4cc0f4d]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0708ee74755483bb1]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-1996458343]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0df4a6dc79f929b2b]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-008b3aa7a98eb2dd6]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0c26045e1e6dc22eb]
aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:972365086582:loadbalancer/app/go-simple-server-alb/3d1a1e622fe088c7]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0d77837d9b95e446b]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0775f5db85f86ab62]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-034e98de56a761ff0]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0708ee74755483bb11080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0643033702df490c61080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0094caf37924ecc1c1080289494]
aws_lb_listener.alb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:972365086582:listener/app/go-simple-server-alb/3d1a1e622fe088c7/1659c1a11e41ec4b]
aws_lb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:972365086582:listener-rule/app/go-simple-server-alb/3d1a1e622fe088c7/1659c1a11e41ec4b/cd52e7adf398fad6]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.cloudwatch_log_group will be created
  + resource "aws_cloudwatch_log_group" "cloudwatch_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/ecs/go-simple-server"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # aws_ecs_cluster.ecs_cluster will be created
  + resource "aws_ecs_cluster" "ecs_cluster" {
      + arn                = (known after apply)
      + capacity_providers = (known after apply)
      + id                 = (known after apply)
      + name               = "go-simple-server"
      + tags_all           = (known after apply)
    }

  # aws_ecs_service.ecs_service will be created
  + resource "aws_ecs_service" "ecs_service" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "go-simple-server"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "go-simple-server"
          + container_port   = 8080
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:972365086582:targetgroup/go-simple-server-target-group/35418404c280c12f"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-01817104820a1c119",
            ]
          + subnets          = [
              + "subnet-01847c06253f6a5a3",
              + "subnet-038a3874d394ce238",
            ]
        }
    }

  # aws_ecs_task_definition.ecs_task_definition will be created
  + resource "aws_ecs_task_definition" "ecs_task_definition" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + environment      = [
                      + {
                          + name  = "HEALTH_CHECK_PATH"
                          + value = "/health_checks"
                        },
                      + {
                          + name  = "NGINX_PORT"
                          + value = "8080"
                        },
                    ]
                  + image            = "medpeer/health_check:latest"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/aws/ecs/go-simple-server"
                          + awslogs-region        = "ap-northeast-1"
                          + awslogs-stream-prefix = "app"
                        }
                    }
                  + name             = "go-simple-server"
                  + portMappings     = [
                      + {
                          + containerPort = 8080
                          + hostPort      = 8080
                        },
                    ]
                },
            ]
        )
      + cpu                      = "256"
      + execution_role_arn       = (known after apply)
      + family                   = "go-simple-server"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
      + task_role_arn            = (known after apply)
    }

  # aws_iam_role.ecs will be created
  + resource "aws_iam_role" "ecs" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "go-simple-server-ecs"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role.ecs_task will be created
  + resource "aws_iam_role" "ecs_task" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "go-simple-server-ecs-task"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.ecs_basic will be created
  + resource "aws_iam_role_policy_attachment" "ecs_basic" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "go-simple-server-ecs"
    }

Plan: 7 to add, 0 to change, 0 to destroy.
aws_iam_role.ecs_task: Creating...
aws_iam_role.ecs: Creating...
aws_ecs_cluster.ecs_cluster: Creating...
aws_cloudwatch_log_group.cloudwatch_log_group: Creating...
aws_iam_role.ecs: Creation complete after 0s [id=go-simple-server-ecs]
aws_iam_role_policy_attachment.ecs_basic: Creating...
aws_iam_role.ecs_task: Creation complete after 0s [id=go-simple-server-ecs-task]
aws_iam_role_policy_attachment.ecs_basic: Creation complete after 0s [id=go-simple-server-ecs-20230527002928232600000001]
aws_cloudwatch_log_group.cloudwatch_log_group: Creation complete after 2s [id=/aws/ecs/go-simple-server]
aws_ecs_task_definition.ecs_task_definition: Creating...
aws_ecs_task_definition.ecs_task_definition: Creation complete after 0s [id=go-simple-server]
aws_ecs_cluster.ecs_cluster: Still creating... [10s elapsed]
aws_ecs_cluster.ecs_cluster: Creation complete after 13s [id=arn:aws:ecs:ap-northeast-1:972365086582:cluster/go-simple-server]
aws_ecs_service.ecs_service: Creating...
aws_ecs_service.ecs_service: Creation complete after 3s [id=arn:aws:ecs:ap-northeast-1:972365086582:service/go-simple-server/go-simple-server]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 7 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":14,"Program":"tfcmt","SHA1":"912f1a1f65e88f2e1aeccce553c322b9b509c6f4","Vars":{},"WorkflowName":"Terraform"} -->